app/controllers/bioportals_controller.rb

  def create_triple
    if params[:oid] and params[:tid] and params[:did] and params[:pid]
      # @ontology = @bioportal.get_ontology(params[:oid], false)
      # @term = @ontology.get_term(params[:tid])
      # @domain = @ontology.get_term(params[:did])
      ontology_id = params[:oid]
      domain_id = params[:did]
      range_id = params[:tid]
      property_id = params[:pid]
      # Now we need to get the ontology and related terms, this will need some major cleaning up, but just very rough for now
      @bpontology = BpOntology.first(:conditions => {:versionid => ontology_id})
      if @bpontology.nil?
        @ontology = @bioportal.get_ontology(ontology_id)
        @bpontology = BpOntology.create(
            :versionid => @ontology.id,
            :ontologyid => @ontology.ontology_id,
            :name => @ontology.label,
            :description => @ontology.description,
            :abbreviation => @ontology.abbreviation
            )
        @bpontology.save
      else
        @ontology = @bioportal.get_ontology(ontology_id, false)
      end
      @bpdomain = BpTerm.first(:conditions => {:bp_ontology_id => @bpontology.id, :bpid => domain_id})
      if @bpdomain.nil?
        @term_domain = @ontology.get_term(domain_id)
        @bpdomain = BpTerm.create(
          :bpid => domain_id,
          :bp_ontology => @bpontology,
          :name => @term_domain.label
          )
---
SELECT * FROM `bp_ontologies` WHERE (`bp_ontologies`.`versionid` = '46348') LIMIT 1
INSERT INTO `bp_ontologies` (`name`, `description`, `abbreviation`, `versionid`, `ontologyid`, `created_at`, `updated_at`) VALUES('Quantitative Imaging Biomarker Ontology', 'An ontology that describes various concepts in quantitative imaging biomarkers. ', 'QIBO', 46348, 1671, '2011-10-07 04:47:20', '2011-10-07 04:47:20')
SELECT * FROM `bp_terms` WHERE (`bp_terms`.`bp_ontology_id` = 1 AND `bp_terms`.`bpid` = 'Biological_Target') LIMIT 1
INSERT INTO `bp_terms` (`name`, `bpid`, `bp_ontology_id`, `created_at`, `updated_at`) VALUES('Biological Target', 'Biological_Target', 1, '2011-10-07 04:54:58', '2011-10-07 04:54:58')

        @bprange.save
      end
      # Now we create the triple unless it already exists
      @triple = BpTriple.first(:conditions => {:domain => @bpdomain.id, :property => property_id, :range => @bprange.id})
---
SELECT * FROM `bp_triples` WHERE (`bp_triples`.`domain` = 3 AND `bp_triples`.`property` = 'is_measured_by' AND `bp_triples`.`range` = 4) LIMIT 1

        @triple = BpTriple.new(
          :domain => @bpdomain, :property => property_id, :range => @bprange
          )
        @triple.save
---
INSERT INTO `bp_triples` (`domain`, `property`, `range`, `created_at`, `updated_at`) VALUES(3, 'is_measured_by', 4, '2011-10-07 05:03:07', '2011-10-07 05:03:07')

  def delete_triple
    if params[:oid] and params[:tripleid]
      @ontology = @bioportal.get_ontology(params[:oid], false)
      triple = BpTriple.find(params[:tripleid])
      if triple
        triple.destroy
---
SELECT * FROM `bp_triples` WHERE (`bp_triples`.`id` = 17)
DELETE FROM `bp_triples` WHERE `id` = 1