app/controllers/bp_ontologies_controller.rb

SELECT * FROM `bp_ontologies`
---
  def index
    @bp_ontologies = BpOntology.all