app/controllers/bp_terms_controller.rb

SELECT * FROM `bp_terms`
---
  def index
    @bp_terms = BpTerm.all

SELECT * FROM `bp_terms` WHERE (`bp_terms`.`id` = 2)
DELETE FROM `bp_terms` WHERE `id` = 2
---
  def destroy
    @bp_term = BpTerm.find(params[:id])
    @bp_term.destroy