app/controllers/bp_triples_controller.rb

  def index
    @bp_triples = BpTriple.all
---
SELECT * FROM `bp_triples`