app/controllers/lexicon_terms_controller.rb

  def destroy
    @lexicon_term = LexiconTerm.find(params[:id])
    @lexicon_term.destroy
---
SELECT * FROM `lexicon_terms` WHERE (`lexicon_terms`.lexicon_term_id = 3)
DELETE FROM `lexicon_terms` WHERE `id` = 3

  def new_lexicon
    lt = LexiconTerm.new(:lexiconName => params[:lexiconName])
    lt.save!
---
INSERT INTO `lexicon_terms` (`codeMeaning`, `codeValue`, `codingSchemeDesignator`, `description`, `lexicon_term_id`, `created_at`, `updated_at`, `codingSchemeVersion`, `lexiconName`) VALUES(NULL, NULL, NULL, NULL, NULL, '2011-08-05 05:47:35', '2011-08-05 05:47:35', NULL, 'LIDC')

  def copy
    lt = LexiconTerm.find(params[:id])
---
SELECT * FROM `lexicon_terms` WHERE (`lexicon_terms`.lexicon_term_id = 2)