app/controllers/main_controller.rb

  def select_template
    params[:id] && params[:id] != 'null' ? @aim_template = AimTemplate.find(params[:id]) : nil
---
SELECT * FROM `aim_templates` WHERE (`aim_templates`.`id` = 1)

  def select_template_container
    params[:id] ? @template_container = TemplateContainer.find(params[:id]) : nil
---
SELECT * FROM `template_containers` WHERE (`template_containers`.`id` = 1)